#!/usr/bin/perl -w
# -*- mode: Perl; coding: cyrillic-koi8; -*-

# Начальный генератор файла z.x.subpatch

# perl -n z.x.pl

use lib '..';
use Lingua::RU::Accent;

BEGIN {
  ($uc,$lc) = ("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ","абвгдеёжзийклмнопрстуфхцчшщъыьэюя");
  $c = "$uc$lc";
}

my (%excw, %exca, $w);

chomp;
#  s/[-,]//g; @F=split(" ");
s/^[<>] (: )?//;

if (s/_буд._ ([$c]+) ([$c]+), -([$c]+), -([$c]+), -([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'б1е','б2е','б3е','б1м','б2м','б3м'} = ("$w$2","$w$3","$w$4","$w$5","$w$6","$w$7");
} elsif (s/_буд._ ([$c]+) ([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'б1е','б3е','б3м'} = ("$w$2","$w$3","$w$4");
} elsif (s/_буд._ ([$c]+) ([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'б1е','б3е'} = ("$w$2","$w$3");
} elsif (s/_буд._ ([$c]+)([$c]), -([$c]+);?\s*//) {
  $w=$1; @excw{'б1е','б3е'} = ("$w$2","$w$3");
} elsif (s/_буд._ ([$c]+), ([$c]+), ([$c]+), ([$c]+), ([$c]+), ([$c]+);?\s*//) {
  @excw{'б1е','б2е','б3е','б1м','б2м','б3м'} = ("$1","$2","$3","$4","$5","$6");
} elsif (s/_буд._ ([$c]+), ([$c]+), ([$c]+);?\s*//) {
  @excw{'б1е','б3е','б3м'} = ("$1","$2","$3");
} elsif (s/_буд._ ([$c]+), ([$c]+);?\s*//) {
  @excw{'б1е','б3е'} = ("$1","$2");
} elsif (s/_буд._ ([$c]+);?\s*//) {
  @excw{'б3е'} = ("$1");
}

if (s/_повел._ -([$c]+);?\s*//) {
  @excw{'!2е'} = ("$w$1");
} elsif (s/_повел._ ([$c]+);?\s*//) {
  @excw{'!2е'} = ("$1");
}

if (s/_прош._ ([$c]+), ([$c]+), ([$c]+), ([$c]+), ([$c]+);?\s*//) {
  @excw{'пем','пеж','пес','пм','чпд'} = ("$1","$2","$3","$4","$5");
} elsif (s/_прош._ ([$c]+), -([$c]+), -([$c]+), -([$c]+), ([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','пес','пм','чпд'} = ("$w","$w$2","$w$3","$w$4","$5");
} elsif (s/_прош._ ([$c]+), -([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','пес','пм'} = ("$w","$w$2","$w$3","$w$4");
} elsif (s/_прош._ ([$c]+) ([$c]+), -([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','пес','пм'} = ("$w$2","$w$3","$w$4","$w$5");
} elsif (s|_прош._ ([$c]+), ([$c]+), ([$c/]+), ([$c]+);?\s*||) {
  @excw{'пем','пеж','пес','пм'} = ("$1","$2","$3","$4");
} elsif (s|_прош._ ([$c]+), -([$c]+), ([$c/]+), ([$c]+);?\s*||) {
  $w=$1; @excw{'пем','пеж','пес','пм'} = ("$w","$w$2","$3","$4");
} elsif (s/_прош._ ([$c]+) ([$c]+), -([$c]+), ([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','чпд'} = ("$w$2","$w$3","$4");
} elsif (s/_прош._ ([$c]+) ([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','чпд'} = ("$w$2","$w$3","$w$4");
} elsif (s/_прош._ ([$c]+) ([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж'} = ("$w$2","$w$3");
} elsif (s/_прош._ ([$c]+), -([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж','чпд'} = ("$w","$w$2","$w$3");
} elsif (s/_прош._ -([$c]+), -([$c]+), -([$c]+);?\s*//) {
  @excw{'пем','пеж','чпд'} = ("$w$1","$w$2","$w$3");
} elsif (s/_прош._ ([$c]+), ([$c]+), ([$c]+);?\s*//) {
  @excw{'пем','пеж','чпд'} = ("$1","$2","$3");
} elsif (s/_прош._ ([$c]+), -([$c]+);?\s*//) {
  $w=$1; @excw{'пем','пеж'} = ("$1","$w$2");
} elsif (s/_прош._ ([$c]+), ([$c]+);?\s*//) {
  @excw{'пем','пеж'} = ("$1","$2");
}

if (s/_прич. страд._ -([$c]+);?\s*//) {
  @excw{'чпс'} = ("$w$1");
} elsif (s/_прич. страд._ ([$c]+);?\s*//) {
  @excw{'чпс'} = ("$1");
}

if (s/\(_кф_ ([$c]+), ([$c]+), ([$c]+), ([$c]+)\)\s*//) {
  @excw{'чпс-кием','чпс-киеж','чпс-киес','чпс-кимм'} = ("$1","$2","$3","$4");
} elsif (s/\(_кф_ ([$c]+), -([$c]+), -([$c]+), -([$c]+)\)\s*//) {
  $w=$1; @excw{'чпс-кием','чпс-киеж','чпс-киес','чпс-кимм'} = ("$w","$w$2","$w$3","$w$4");
}

foreach $key (sort(keys %excw)) {
  ($exca{$key}=Lingua::RU::Accent::raccent($excw{$key},'u'))=~s/,.*//;
  $excw{$key}=~tr/АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ/абвгдеёжзийклмнопрстуфхцчшщъыьэюя/;
}

print "> {", join(",", map {
  "'$_'=>[{w=>'$excw{$_}',a=>$exca{$_}}]"
} grep { defined $excw{$_} } qw(б1е н1е б2е н2е б3е н3е
                                б1м н1м б2м н2м б3м н3м
                                !2е !2м
                                пем пеж пес пм
                                чпд чпс чпс-кием чпс-киеж чпс-киес чпс-кимм)),
  "}\n";

($_ ne "") && print "#$_\n";
