#!/usr/bin/perl -w
# usage: perl parad.pl

use GDBM_File;

$dicfile = "../zaliz.dbm";
tie(%dict, 'GDBM_File', $dicfile, 0, 0640); # untie(%dict);

$v = "аеёиоуыэюя"; # glasnaja
#  $c = "бвгджзйклмнпрстфхцчшщ"; # soglasnaja

%fls = (
       ""    => "ием1|рм[сж]1",
       "ь"   => "ием2|рм[сж]2|[ив]е.8",
       "а"   => "ре[мс]1|иеж1|имс1",
       "я"   => "ре[мс]2|иеж2|имс2",
       "ам"  => "дм[мсж]1",
       "ям"  => "дм[мсж]2",
       "ами" => "тм[мсж]1",
       "ями" => "тм[мсж]2",
       "ах"  => "пм[мсж]1",
       "ях"  => "пм[мсж]2",
       "о"   => "иес1",
       "е"   => "иес2|деж[12]|пе[мсж][12]",
       "ей"  => "теж2|рм[мсж]2",
       "ею"  => "теж2|рм[мсж]2",
       "ов"  => "рмм1",
       "ой"  => "теж1",
       "ою"  => "теж1",
       "ом"  => "те[мс]1",
       "ем"  => "те[мс]2|те[мс]8",
       "ы"   => "реж1|им[жм]1",
       "и"   => "реж2|им[мж]2|[рдп]е.8",
       "у"   => "де[мс]1|веж1",
       "ю"   => "де[мс]2|веж2",
       "ью"  => "теж8",
      );

while (<DATA>) {
#  while (($_,$value) = each %dict) {
  next if /^\#/;
  chomp;
  if ($value = $dict{$_}) {
    parad($_,$value);
  } else {
#      print "несловарное слово: $_\n";
  }
}

sub parad {
  my ($w, $s) = @_;
  my $base = base($w);
  my ($r,$t,$ch) = $s =~ /(.)(.)(.)/;
  my ($t2);
  if ($t eq "0") { print "$w\n"; return }
  (print "$w\n"),return if $r !~ /^[мжс]/; # not yet
  $t2 = "1" if $t =~ /[1345]/;
  $t2 = "2" if $t =~ /[267]/;
  $t2 = "8" if $t =~ /[8]/;
  for $i (
          "ие","ре","де","те","пе","им","рм","дм","тм","пм"
          # "ие","им","ре","рм","де","дм",#"ве","вм",
          # "те","тм","пе","пм"
         ) {
    my $p = $i.$r.($t eq "8" && $i =~ /м/ ? "2" : $t2);
    my $post = get_post($p);
    if ($t eq "3") { $post =~ s/ы/и/ }
    if ($t eq "4") {
      $post =~ s/ы/и/; $post =~ s/о/е/;
      if ($i eq "рм") {
        if ($r eq "м") { $post = "ей" }
        elsif ($r eq "ж" || $r eq "с") { $post = "" }
      }
    }
    if ($t eq "5") { $post =~ s/о/е/ }
    if ($t eq "6" || $t eq "7") {
      $post =~ s/ь/й/;
      if ($i eq "рм") {
        if ($r eq "м") { $post = "ев" }
        elsif ($r eq "ж" || $r eq "с") { $post = "й" }
      }
    }
    if ($t eq "7") {
      if ($i eq "де" && $r eq "ж" || $i eq "пе") { $post = "и" }
    }
    if ($t eq "8" && $i =~ /рм/) { $post = "ей" }

    my $new = $base . $post;
    if ($ch eq "*" && $post =~ /^(й|ью?)?$/) { substr($new,length($new)-1,0)="o" }
    print "$new ";
  }
#    print "$w:$base:($r,$t,$t2,$ch)\n";
  print "\n";
}

sub base {
  my ($word) = @_;
  $word =~ s/..ся$//;
  $word =~ s/[$vйь]$//;
  $word;
}

sub get_post {
  my $p = shift;
  my $return = "?";
  while (($key,$value) = each %fls) {
#      print "<$value>\n";
    if ($p =~ m/^$value$/) { $return = $key }
  }
  $return
}


__DATA__
# a
завод
артист
портфель
житель
чайник
бульдог
марш
товарищ
месяц
принц
случай
герой
сценарий
викарий
# b
топор
бегун
словарь
карась
пирог
рыбак
нож
богач
кострец
кузнец
лишай
холуй
кий
# c-f
дар
плуг
харч
буй
кол
казак
зуб
голубь
волк
обруч
конь
# 1*a
свекор
бубен
заем
# 1*b
бугор
угол
котёл
хребет
узел
кочан
лёд
лев
# 1*e
ветер
# 2*a
деготь
ливень
увалень
# 2*b
огонь
ломоть
угорь
ремень
# 2*e
ноготь
корень
# 3*a
кубок
кусочек
перешеек
# 3*b
кусок
хорёк
паёк
# 5*a
немец
палец
китаец
заяц
# 5*b
конец
жилец
боец
# 6*
улей
ручей
муравей
# 1**
римлянин
южанин
армянин
боярин
господин
шурин
# 3**
цыплёнок
мышонок
цыплёночек
мышоночек
щенок
# "1"
рукав
мастер
якорь
обшлаг
округ
сторож
край
промысел
ветер
господин
# "2"
грузин
раз
волос
сапог
герц
ботинок
ботиночек
чулок
глазок
рожок
мадьяр
чувяк
черевичек
# "1""2"
глаз
# ё
осётр
мёд
чёрт
жёлудь
ёж
жёрнов
шёлк
# мн.
анналы
весы
дебри
кочкари
сани
трусики
духи
пассатижи
щи
дрожжи
помои
прелиминарии
плавни
дровни
останки
очки
плоскозубцы
щипцы
леса
зеленя
торока
# Особые случаи
зуб
луб
кол
стул
копыл
ком
клин
струп
брус
брат
лист
лоскут
прут
клок
сук
крюк
обод
повод
полоз
колос
собрат
#
муж
князь
деверь
зять
друг
сын
кум
шурин
#
гражданин
сосед
чёрт
бесёнок
щенок
щеночек
цветок
хозяин
барин
ребёнок
ребёночек
человек
#
цыган
болгарин
татарин
хазарин
барин
год
зверь
#
заём
угол
угорь
узел
#
заяц
кочан
#
перёд
господь
Христос
полдень

