
wf_domains :- setofall(D,wf(D,_,_,_,_,_,_,_),L),write('D: '),writeln(L),fail.
wf_domains :- setofall(N,wf(_,N,_,_,_,_,_,_),L),write('N: '),writeln(L),fail.
wf_domains :- setofall(G,wf(_,_,G,_,_,_,_,_),L),write('G: '),writeln(L),fail.
wf_domains :- setofall(T,wf(_,_,_,T,_,_,_,_),L),write('T: '),writeln(L),fail.
wf_domains :- setofall(U,wf(_,_,_,_,U,_,_,_),L),write('U: '),writeln(L),fail.
wf_domains :- setofall(A,wf(_,_,_,_,_,A,_,_),L),write('A: '),writeln(L),fail.
wf_domains :- setofall(C,wf(_,_,_,_,_,_,C,_),L),write('C: '),writeln(L),fail.
wf_domains :- setofall(S,wf(_,_,_,_,_,_,_,S),L),write('S: '),write_sl(L," "),nl,fail.

check_domain_coverage :-
        member(DA,"смак"), name(D,[DA]),
        member(NA,"ем"), name(N,[NA]),
        member(GA,"мсж"), name(G,[GA]),
        member(TA,"12"), name(T,[TA]),
        member(UA,"бу"), name(U,[UA]),
        member(AA,"но"), name(A,[AA]),
        (D\==к, member(CA,"ирдвтп"), name(C,[CA]) ; D==к, C=и),
        not(wf(D,N,G,T,U,A,C,_)),
        write(wf(D,N,G,T,U,A,C)),nl,fail.

% wf("",D,G,N,T,T,A) :- (D=с, (G=м, ((T=и ; (T=в, A=о))) T=и ; (T=в, A=н)

% D="смак", N="ем", G="мсж", T="12", U="бу_", A="но_", C="ирдвтп"

%% Стандартные окончания субстантивного склонения

wf(с,е,м,1,U,A,и,"" ) :- (U=б;U=у), (A=н;A=о).
wf(с,е,м,2,U,A,и,"ь") :- (U=б;U=у), (A=н;A=о).
wf(с,е,с,1,U,A,и,"о") :- (U=б;U=у), (A=н;A=о).
wf(с,е,с,2,б,A,и,"е") :- (A=н;A=о).
wf(с,е,с,2,у,A,и,"ё") :- (A=н;A=о).
wf(с,е,ж,1,U,A,и,"а") :- (U=б;U=у), (A=н;A=о).
wf(с,е,ж,2,U,A,и,"я") :- (U=б;U=у), (A=н;A=о).
wf(с,м,м,1,U,A,и,"ы") :- (U=б;U=у), (A=н;A=о).
wf(с,м,м,2,U,A,и,"и") :- (U=б;U=у), (A=н;A=о).
wf(с,м,с,1,U,A,и,"а") :- (U=б;U=у), (A=н;A=о).
wf(с,м,с,2,U,A,и,"я") :- (U=б;U=у), (A=н;A=о).
wf(с,м,ж,1,U,A,и,"ы") :- (U=б;U=у), (A=н;A=о).
wf(с,м,ж,2,U,A,и,"и") :- (U=б;U=у), (A=н;A=о).

wf(с,е,G,1,_,_,р,"а" )  :- G=м;G=с.
wf(с,е,G,2,_,_,р,"я" )  :- G=м;G=с.
wf(с,е,ж,1,_,_,р,"ы" ).
wf(с,е,ж,2,_,_,р,"и" ).
wf(с,м,м,1,_,_,р,"ов").
wf(с,м,м,2,_,_,р,"ей").
wf(с,м,G,1,_,_,р,""  ) :- G=с;G=ж.
wf(с,м,G,2,б,_,р,"ь" ) :- G=с;G=ж.
wf(с,м,G,2,у,_,р,"ей") :- G=с;G=ж.

wf(с,е,G,1,_,_,д,"у" ) :- G=м;G=с.
wf(с,е,G,2,_,_,д,"ю" ) :- G=м;G=с.
wf(с,е,ж,T,_,_,д,"е" ) :- T=1;T=2.
wf(с,м,G,1,_,_,д,"ам") :- G=м;G=с;G=ж.
wf(с,м,G,2,_,_,д,"ям") :- G=м;G=с;G=ж.

wf(с,е,м,T,U,н,в,S  ) :- wf(с,е,м,T,U,_,и,S).
wf(с,е,м,T,U,о,в,S  ) :- wf(с,е,м,T,U,_,р,S).
wf(с,е,с,T,U,A,в,S  ) :- wf(с,е,с,T,U,A,и,S).
wf(с,е,ж,1,_,_,в,"у").
wf(с,е,ж,2,_,_,в,"ю").
wf(с,м,G,T,U,н,в,S  ) :- wf(с,м,G,T,U,_,и,S).
wf(с,м,G,T,U,о,в,S  ) :- wf(с,м,G,T,U,_,р,S).

wf(с,е,G,1,_,_,т,"ом") :- G=м;G=с.
wf(с,е,G,2,б,_,т,"ем") :- G=м;G=с.
wf(с,е,G,2,у,_,т,"ём") :- G=м;G=с.
wf(с,е,ж,1,_,_,т,S   ) :- S="ой";S="ою".
wf(с,е,ж,2,б,_,т,S   ) :- S="ей";S="ею".
wf(с,е,ж,2,у,_,т,S   ) :- S="ёй";S="ёю".
wf(с,м,G,1,_,_,т,"ами") :- G=м;G=с;G=ж.
wf(с,м,G,2,_,_,т,"ями") :- G=м;G=с;G=ж.

wf(с,е,G,T,_,_,п,"е" ) :- (G=м;G=с;G=ж), (T=1;T=2).
wf(с,м,G,1,_,_,п,"ах") :- G=м;G=с;G=ж.
wf(с,м,G,2,_,_,п,"ях") :- G=м;G=с;G=ж.

%% Стандартные окончания адъективного склонения, полные формы

wf(а,е,м,1,б,_,и,"ый").
wf(а,е,м,1,у,_,и,"ой").
wf(а,е,м,2,_,_,и,"ий").
wf(а,е,с,1,_,_,и,"ое").
wf(а,е,с,2,_,_,и,"ее").
wf(а,е,ж,1,_,_,и,"ая").
wf(а,е,ж,2,_,_,и,"яя").
wf(а,м,G,1,_,_,и,"ые") :- G=м;G=с;G=ж.
wf(а,м,G,2,_,_,и,"ие") :- G=м;G=с;G=ж.

wf(а,е,G,1,_,_,р,"ого") :- G=м;G=с.
wf(а,е,G,2,_,_,р,"его") :- G=м;G=с.
wf(а,е,ж,1,_,_,р,"ой" ).
wf(а,е,ж,2,_,_,р,"ей" ).
wf(а,м,G,1,_,_,р,"ых" ) :- G=м;G=с;G=ж.
wf(а,м,G,2,_,_,р,"их" ) :- G=м;G=с;G=ж.

wf(а,е,G,1,_,_,д,"ому") :- G=м;G=с.
wf(а,е,G,2,_,_,д,"ему") :- G=м;G=с.
wf(а,е,ж,1,_,_,д,"ой" ).
wf(а,е,ж,2,_,_,д,"ей" ).
wf(а,м,G,1,_,_,д,"ым" ) :- G=м;G=с;G=ж.
wf(а,м,G,2,_,_,д,"им" ) :- G=м;G=с;G=ж.

wf(а,е,м,T,U,н,в,S   ) :- wf(а,е,м,T,U,_,и,S).
wf(а,е,м,T,U,о,в,S   ) :- wf(а,е,м,T,U,_,р,S).
wf(а,е,с,T,U,A,в,S   ) :- wf(а,е,с,T,U,A,и,S).
wf(а,е,ж,1,_,_,в,"ую").
wf(а,е,ж,2,_,_,в,"юю").
wf(а,м,G,T,U,н,в,S   ) :- wf(а,м,G,T,U,_,и,S).
wf(а,м,G,T,U,о,в,S   ) :- wf(а,м,G,T,U,_,р,S).

wf(а,е,G,1,_,_,т,"ым" ) :- G=м;G=с.
wf(а,е,G,2,_,_,т,"им" ) :- G=м;G=с.
wf(а,е,ж,1,_,_,т,S    ) :- S="ой";S="ою".
wf(а,е,ж,2,_,_,т,S    ) :- S="ей";S="ею".
wf(а,м,G,1,_,_,т,"ыми") :- G=м;G=с;G=ж.
wf(а,м,G,2,_,_,т,"ими") :- G=м;G=с;G=ж.

wf(а,е,G,1,_,_,п,"ом") :- G=м;G=с.
wf(а,е,G,2,_,_,п,"ем") :- G=м;G=с.
wf(а,е,ж,1,_,_,п,"ой").
wf(а,е,ж,2,_,_,п,"ей").
wf(а,м,G,1,_,_,п,"ых") :- G=м;G=с;G=ж.
wf(а,м,G,2,_,_,п,"их") :- G=м;G=с;G=ж.

%% Стандартные окончания адъективного склонения, краткие формы

wf(к,е,м,1,_,_,и,"" ).
wf(к,е,м,2,_,_,и,"ь").
wf(к,е,с,1,_,_,и,"о").
wf(к,е,с,2,б,_,и,"е").
wf(к,е,с,2,у,_,и,"ё").
wf(к,е,ж,1,_,_,и,"а").
wf(к,е,ж,2,_,_,и,"я").
wf(к,м,G,1,_,_,и,"ы") :- G=м;G=с;G=ж.
wf(к,м,G,2,_,_,и,"и") :- G=м;G=с;G=ж.

%% Стандартные окончания местоименного склонения

wf(м,е,м,1,_,_,и,"" ).
wf(м,е,м,2,_,_,и,"ь").
wf(м,е,с,1,_,_,и,"о").
wf(м,е,с,2,б,_,и,"е").
wf(м,е,с,2,у,_,и,"ё").
wf(м,е,ж,1,_,_,и,"а").
wf(м,е,ж,2,_,_,и,"я").
wf(м,м,G,1,_,_,и,"ы") :- G=м;G=с;G=ж.
wf(м,м,G,2,_,_,и,"и") :- G=м;G=с;G=ж.

wf(м,е,G,1,_,_,р,"ого") :- G=м;G=с.
wf(м,е,G,2,_,_,р,"его") :- G=м;G=с.
wf(м,е,ж,1,_,_,р,"ой" ).
wf(м,е,ж,2,_,_,р,"ей" ).
wf(м,м,G,1,_,_,р,"ых" ) :- G=м;G=с;G=ж.
wf(м,м,G,2,_,_,р,"их" ) :- G=м;G=с;G=ж.

wf(м,е,G,1,_,_,д,"ому") :- G=м;G=с.
wf(м,е,G,2,_,_,д,"ему") :- G=м;G=с.
wf(м,е,ж,1,_,_,д,"ой" ).
wf(м,е,ж,2,_,_,д,"ей" ).
wf(м,м,G,1,_,_,д,"ым" ) :- G=м;G=с;G=ж.
wf(м,м,G,2,_,_,д,"им" ) :- G=м;G=с;G=ж.

wf(м,е,м,T,U,н,в,S  ) :- wf(м,е,м,T,U,_,и,S).
wf(м,е,м,T,U,о,в,S  ) :- wf(м,е,м,T,U,_,р,S).
wf(м,е,с,T,U,A,в,S  ) :- wf(м,е,с,T,U,A,и,S).
wf(м,е,ж,1,_,_,в,"у").
wf(м,е,ж,2,_,_,в,"ю").
wf(м,м,G,T,U,н,в,S  ) :- wf(м,м,G,T,U,_,и,S).
wf(м,м,G,T,U,о,в,S  ) :- wf(м,м,G,T,U,_,р,S).

wf(м,е,G,1,_,_,т,"ым" ) :- G=м;G=с.
wf(м,е,G,2,_,_,т,"им" ) :- G=м;G=с.
wf(м,е,ж,1,_,_,т,S    ) :- S="ой";S="ою".
wf(м,е,ж,2,_,_,т,S    ) :- S="ей";S="ею".
wf(м,м,G,1,_,_,т,"ыми") :- G=м;G=с;G=ж.
wf(м,м,G,2,_,_,т,"ими") :- G=м;G=с;G=ж.

wf(м,е,G,1,_,_,п,"ом") :- G=м;G=с.
wf(м,е,G,2,б,_,п,"ем") :- G=м;G=с.
wf(м,е,G,2,у,_,п,"ём") :- G=м;G=с.
wf(м,е,ж,1,_,_,п,"ой").
wf(м,е,ж,2,_,_,п,"ей").
wf(м,м,G,1,_,_,п,"ых") :- G=м;G=с;G=ж.
wf(м,м,G,2,_,_,п,"их") :- G=м;G=с;G=ж.


wf2(_,D,N,G,1,U,A,C,S) :- wf(D,N,G,1,U,A,C,S).
wf2(_,D,N,G,2,U,A,C,S) :- wf(D,N,G,2,U,A,C,S).

%% Отличия типов склонения 3-7 от 1,2

wf2(B,D,N,G,3,U,A,C,S) :-
        lastof(B,"кгх"), wf(D,N,G,1,U,A,C,S2),
        replace2(0'ы,0'и,S2,S).
wf2(B,D,N,G,4,U,A,C,S) :-
        lastof(B,"шжчщ"), wf(D,N,G,1,U,A,C,S2),
        replace2(0'ы,0'и,S2,S3), replace2(0'о,0'е,S3,S).

wf3(W,D,N,G,T,U,A,C,WF) :- nonvar(W), wbase(W,D,B), wf2(B,D,N,G,T,U,A,C,S), append(B,S,WF).
wf3(W,D,N,G,T,U,A,C,WF) :- nonvar(WF), append(B,S,WF), wf2(B,D,N,G,T,U,A,C,S), wbase(W,D,B).

%% графическая основа слова
wbase(W,D,B) :- (D=с;D=м), append(B,[C],W), member(C,"аеёийоуьыэюя"), !.
wbase(W,D,W) :- (D=с;D=м), !.
wbase(W,а,B) :- append(B,[_,_,0'с,0'я],W), !.
wbase(W,а,B) :- append(B,[_,_],W), !.


% ?- wf3("куздра",с,N,ж,1,U,о,C,S),writef("%w %w %s\n",[N,C,S]),fail.


%% 

% ?- w(W,_,P,T,_,_,_,_),p_d(P,D),name(W,WW),wbase(WW,D,B),last(C,B),name(CA,[C]),writeln([CA,T]),fail.

p_d(м,с).
p_d(мо,с).
p_d(с,с).
p_d(со,с).
p_d(ж,с).
p_d(жо,с).
p_d(п,а).


%!!! ?- w(W,_,P,T,_,_,_,_),p_d(P,D),name(W,WW),wbase(WW,D,B),last(C,B),not(t_l(T,C)),name(CA,[C]),writeln([CA,T]),fail.

t_l(0,_).
t_l(T,C) :- (T=1;T=2), member(C,"бдвзлмнпрстфьъ").
t_l(3,C) :- member(C,"кгх").
t_l(4,C) :- member(C,"шжчщ").
t_l(5,C) :- member(C,"ц"). % t_l(5,0'ц).
t_l(6,C) :- member(C,"аеёоуыэюяй").
t_l(7,C) :- member(C,"и"). % t_l(7,0'и).


% ?- w(W,_,P,T,_,_,_,_),p_d(P,D),T==0,name(W,WW),wbase(WW,D,B),last(C,B),name(CA,[C]),writeln([W,CA,T,P]),fail.
% ?- w(W,_,P,T,_,_,_,_),p_d(P,D),T==2,name(W,WW),wbase(WW,D,B),last(C,B),name(CA,[C]),writeln([W,CA,T,P]),fail.
% ?- w(W,_,P,T,_,_,_,_),p_d(P,D),T==8,name(W,WW),wbase(WW,D,B),last(C,B),name(CA,[C]),writeln([W,CA,T,P]),fail.

% ?- w(W,_,G,2,_),(G==ж;G==жо),name(W,WW),wbase(WW,с,BB),last(0'я,BB),puts(WW),fail.
% ?- setofall(C,(w(W,_,G,2,_),(G==ж;G==жо),name(W,WW),wbase(WW,с,BB),last(C,BB)),L),puts(L).
% ?- w(W,_,м,8,_).                
% ?- w(W,_,с,8,_).

% setofall(Z,(w(W,_,G,8,_),name(W,WW),append(_,[X,Y],WW),Z=[X,Y]),L),write_sl(L," ").
% бь дь фь ли ль мя мь нь пь рь ся сь ти ть жи жь ви вь зь шь щь чь

% setofall(Z,(w(W,_,G,8,_),name(W,WW),append(_,[X],WW),Z=X),L),puts(L).
% ияь

%! w(W,_,ж,2,_),name(W,WW),append(_,[0'ь],WW),writeln(W),fail.
%! w(W,_,ж,8,_),name(W,WW),append(_,[0'я],WW),writeln(W),fail.
%! w(W,_,жо,8,_),name(W,WW),append(_,[0'я],WW),writeln(W),fail.

% words with one letter different
% коготь копоть, бель гель гиль, газель гафель,
% гвоздь гроздь груздь грусть
% ?- w(W,_,_,_,_),name(W,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3).
% ?- w(W1,_,_,_,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),w(W2,_,_,_,_),W1\==W2,name(W2,WW3).
% ?- w(W1,_,_,_,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),w(W2,_,_,_,_),W1\==W2,name(W2,WW3),writef("%w %w\n",[W1,W2]),fail.
% ?- w(W1,_,G1,P1,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),w(W2,_,G2,P2,_),W1\==W2,name(W2,WW3),writef("%w %w %w = %w %w %w\n",[W1,G1,P1,W2,G2,P2]),fail.
% ?- tell(similar),w(W1,_,G1,P1,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),w(W2,_,G2,P2,_),W1\==W2,name(W2,WW3),writef("%w %w %w = %w %w %w\n",[W1,G1,P1,W2,G2,P2]),flush,fail;told.
% ?- tell(similar),w(W1,_,G1,P1,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),once((w(W2,_,G2,P2,_),W1\==W2,name(W2,WW3))),writef("%w %w %w = %w %w %w\n",[W1,G1,P1,W2,G2,P2]),flush,fail;told.
% ?- tell(similar),w(W1,_,G1,P1,_),name(W1,WW),append(WW1,[_|WW2],WW),append(WW1,[_|WW2],WW3),once((w(W2,_,G2,P2,_),name(W2,WW3))),W1\==W2,writef("%w %w %w = %w %w %w\n",[W1,G1,P1,W2,G2,P2]),flush,fail;told.


check_types :-
        w(W,_,G,P1,_), G\==св, G\==св_нсв, G\==мн, G\==межд, G\==мс_п, P1\==0,
        name(W,WW), append(_,[C0,C2],WW),
        not(((C0==0'а;C0==0'я),C2==0'я;(C0==0'и;C0==0'ы),C2==0'й;C0==0'о,(C2==0'е;C2==0'й);C0==0'е,C2==0'е;C0==0'с,C2==0'я)),
        (G==мо_жо -> R=ж ; name(G,[RR|_]), name(R,[RR])),
        (R==м;R==с;R==ж),
        wbase(WW,с,B), append(_,[C1],B),
        l_t(P2,R,C1,C2), P1\==P2,
        writef("%w %w %w %w\n",[W,G,P1,P2]), fail.

l_t(8,G,_,C2) :- member(C2,"ь"), (G=ж;G=с), !.
l_t(3,_,C1,_) :- member(C1,"кгх"), !.
l_t(4,_,C1,_) :- member(C1,"шжчщ"), !.
l_t(5,_,C1,_) :- member(C1,"ц"), !.
l_t(6,_,C1,_) :- member(C1,"аеёоуыэюяй"), !.
l_t(6,_G,C1,_) :- member(C1,"ь"), !. % G=с, !. % !!!
l_t(7,_,C1,_) :- member(C1,"и"), !.
l_t(2,G,_,C2) :- member(C2,"ь"), G=м, !.
l_t(1,G,_,C2) :- member(C2,"о"), G=с, !.
l_t(1,G,_,C2) :- member(C2,"а"), G=ж, !.
l_t(2,G,_,C2) :- member(C2,"её"), G=с, !.
l_t(2,G,_,C2) :- member(C2,"я"), G=ж, !.
l_t(8,G,_,C2) :- member(C2,"я"), G=с, !.
l_t(1,G,_,_)  :- G=м, !.
l_t(0,_,_,_)  :- !.


% ?- w(W,_,G,P,_),G\==св,G\==нсв,G\==св_нсв,name(W,WW),append(_,[0'у,0'т,0'ь],WW),writeln([W,G,P]),fail.
% жуть муть ничуть путь ртуть суть чуть чуть-чуть

% ?- w(W,_,G,P,_),(G==м;G==мо),name(W,WW),append(_,[0'т,0'ь],WW),writeln([W,G,P]),fail.
% гость деготь диван-кровать зять коготь лапоть локоть ломоть нехристь ноготь
% путь розмыть тать тесть ять

% ?- w(W,_,м,_,_),w(W,_,ж,_,_),writeln(W),fail.
% картель кипень майя моль парасоль перкаль персоль псалтырь ритурнель
% табель шампунь

% ?- w(W,_,мо,_,_),w(W,_,жо,_,_),writeln(W),fail.
% выхухоль подлинь

% ?- w(W,_,мо_жо,_,_),name(W,WW),append(_,[C],WW),not(member(C,"аеиоуэюя")),writeln(W),fail.
% ханты цирлих-манирлих

% ?- w(W,_,G,P,_),P\==0,(G==м;G==мо),name(W,WW),append(_,[C],WW),member(C,"аеиоуэюя"),writeln(W),fail.
% воздержавшийся вольноопределяющийся трудящийся тяжущийся учащийся

% second accent is after first accent ?
% ?- w(W,a(X,Y)), (X=e(XX)->true;X=XX), (Y=e(YY)->true;Y=YY), XX =< YY.
