#!/usr/bin/perl -w
# -*- mode: Perl; coding: cyrillic-koi8; -*-
# $Id$
# Copyright (c) 2000  Juri Linkov <juri@eta.org>
# This file is distributed under the terms of the GNU GPL.

# perl zaliz2pl.pl ~/doc/lang/rus/zaliz/zaliz/zaliz > zaliz.pl

$card  = "CARD|N-PLT|PRON";
$inflex  = "INFLEX-(?:N-(?:F|M|N|PLT)|PRON)";

$fix = "межд|предик|предл|союз|сравн|вводн|част";

$types = "мо?(?:-жо)?|жо?|со?|мн|мс(?:-п)?|п|числ(?:-п)?|н";

$verb = "св(?:-нсв)?|нсв";

$types = "$card|$inflex|$fix||$verb";

while(<>) {
    chomp; #s/\'/''/g;

    # correct errors in the input file
    # butter better is to edit manually and apply patch
    s/^\`всякий /\`всякий 3/;
    s/лен-долгунец 11,2 /лен-долгунец 11.2,2 /;
    s/желто-зеленый 10.2,10/желто-зеленый 10,10.2,2/;
    s/темно-зеленый 10.2,10/темно-зеленый 10,10.2,2/;
    s/мо- жо/мо-жо/;
    s/припудрить 5 ск/припудрить 5 св/;
    s|выскрести 2 св 7a \(-б-\) I\(-ё-\)//II|выскрести 2 св 7a \(-б-\) \$I\(-ё-\)//II|;
    s|персонаж 7 м 4a//мо 4a|персонаж 7 м//мо 4a|;
    s|пугало 2 с 1a ; с//во|пугало 2 с 1a ; с//со|;
    s|пулярка 4 жо 3\*a жо//ж|пулярка 4 жо 3\*a; жо//ж|;
    s|флагман 3 мо 1a () мо//м, 1a|флагман 3 мо 1a (); мо//м, 1a|;
    s|голосина 6 м//ж, 1a|голосина 6 м//ж, ж 1a|;
    s/беремя 4 с 8\*\*c -/беремя 4 с 8\*\*c-/; # ???
#      if(/\/\//) { print "% $_\n"; next; } # tmp

    $o = $_; $w = $s = $p = $c = ""; $an = "н";
    s/^\`?([^\d]+)\s+([\d.,]+)\s+//; ($w,$ac0) = ($1,$2);
    $p = "'$w'";

#      if(s/\s*(\([^\(]*\))//) { $c = $1; }

    #  абажур 5                 5              абажу'р
    #  аистенок 5,5             e(5)           аистёнок
    #  агитбригада 9.3          a(9,3)         аги`тбрига'да
    #  впередсмотрящий 12.5,5   a(12,e(5))     вперёдсмотря'щий
    #  светло-зеленый 11,11.3   a(e(11),3)     све`тло-зелёный
    #  темно-зеленый 10,10.2,2  a(e(10),e(2))  тёмно-зелёный
    if(   $ac0 =~ /^(\d+)\,(\d+)\.(\d+)\,(\d+)$/ && $1 eq $2 && $3 eq $4)
                                                       { $ac = "a(e($1),e($3))"; }
    elsif($ac0 =~ /^(\d+)\.(\d+)\,(\d+)$/ && $2 eq $3) { $ac = "a($1,e($2))"; }
    elsif($ac0 =~ /^(\d+)\.(\d+)\,(\d+)$/ && $1 eq $3) { $ac = "a(e($1),$2)"; }
    elsif($ac0 =~ /^(\d+)\,(\d+)\.(\d+)$/ && $1 eq $2) { $ac = "a(e($2),$3)"; }
    elsif($ac0 =~ /^(\d+)\,(\d+)$/        && $1 eq $2) { $ac = "e($1)"   ; }
    elsif($ac0 =~ /^(\d+)\.(\d+)$/                   ) { $ac = "a($1,$2)"; }
    elsif($ac0 =~ /^(\d+)$/                          ) { $ac = "$1"      ; }
    else                                               { $ac = "unknown" ; }
    $p .= ",$ac";

    if(s/^мн\.\s+//) {
        if(s/неод.\s*//) { $an = "н"; }
        if(s/одуш.\s*//) { $an = "о"; }
        if(s/(м|ж|с)о/\1/) { $an = "о"; }
        if(s/(м|ж|с|п)\s*//) { $p .= ",мн,$an,$1"; }
        print "$p\n";
    } elsif(s/(м|ж|с)(о)?\s*//) {
        
    }

    next;

    s/числ\.-п/числ-п/; s/$/ /; # hacks!
    if(s/^($types)([.,])?\s+//) {
#          print "$w: $1:$2\n";
        print "$w: $1:$2:$3:$4:$5:$6:$7:$8:$9:$_\n";
    } else {
        print "$w: unknown: $o\n";
    }

#      print "w($p).\n";
#      print "$_\n";
}

#  абажур 5 м 1а lamp-shade shade
#  абак 3 м 3а [//аб┬ка] 
#  альпага 7 мо//жо, 0 [//альпак┬] (_порода лам_) 
#  альпага 7 с 0[//альпак┬] (_сорт шерсти_) 
#  альпака 7 мо//жо, 0 [//альпаг┬] (_порода лам_) alpaca
#  альпака 7 с 0 [//альпаг┬] (_сорт шерсти_) 
#  авиапромышленный 9.1 п 1*a"1"
#  w('авиапромышленный',a(9,1),)


#  w('авторизованный',a(8),'п',1,a(а),"*",1,'#9').

#      print "w('$w',a($a),'$symbol',$num,a(а),\"*\",1,'#9').";
#      if($comments) { print " % $comments"; }
#      print "\n";

#      ($a, $comments, $fak, $symbol, $num) = (0, "", "", "", 0);
#      ($recno,$w,$grammar,$trans) = split /\t/;
#      $w =~ s/\s+//g; if($trans =~ s/^\)//) { $grammar .= ")"; } # hacks
#      if($grammar =~ s/^([0-9,.]+)\s*//) { $a = $1; }
#      if($grammar =~ s/\(_(.*)_\)//) { $comments = $1; }
#      if($grammar =~ s/\[(.*)\]//) { $fak = $1; }
#      if($grammar =~ s/^(\S+)\s*//) { $symbol = $1; }
#      if($grammar =~ s/^(\d+)\s*//) { $num = $1; }
