%% -*- mode: Prolog; coding: cyrillic-koi8; -*-

wex(аллилуйя,с(р,м),аллилуй,6).
wex(барышня,с(р,м),барышень,2).
wex(близкий,п(ср),ближе,3).

% блистать 6 нсв нп 1а =>
% блистать 6 нсв нп 6с @_наст._ блещ√, бл┼щет, бл┼щут <=
wex(w(блистать,6,г(нсв),[г,6,"6"],''),г(н,1,е),блещу,5).
wex(w(блистать,6,г(нсв),[г,6,"6"],''),г(н,3,е),блещет,3).
wex(w(блистать,6,г(нсв),[г,6,"6"],''),г(н,3,м),блещут,3).

% богатый 4 мо п 1а
% богатый 4 п 1а @ _сравн._ бог┬че
wex(w(богатый,4,п,[а,1,"1"],''),п(ср),богаче,4).
