
nn(N) --> nn1000(N1000), [тысяч], nn1000(N100), {N is N1000*1000+N100}.
nn(N) --> nn1000(N).

nn1000(N) --> n1000(N100), n20(N1), {N is N100*100+N1}.
nn1000(N) --> n1000(N100), n100(N10), n10(N1), {N is N100*100+N10*10+N1}.

n10(1)  --> [один]  .
n10(2)  --> [два]   .
n10(3)  --> [три]   .
n10(4)  --> [четыре].
n10(5)  --> [пять]  .
n10(6)  --> [шесть] .
n10(7)  --> [семь]  .
n10(8)  --> [восемь].
n10(9)  --> [девять].
n10(10) --> [десять].
%n10(0)  --> [].

% n20(N) --> n10(N10), [надцать], 
%         (append(X3,"ь",X2)                    ; X2=X3),
%         (append(X4,"е",X3)                    ; X3=X4),
%         (append(X6,"а",X4), append(X6,"е",X5) ; X4=X5),
%         append(X5,"надцать",X), !.

n10(0)   --> [].
n100(0)  --> [].
n1000(0) --> [].


n(N)  :- num(N,X), name(Y,X), write(Y), nl, fail.
n2(N) :- num(N,X), name(Y,X), w(Y,A,B,C), write([Y,A,B,C]), nl, fail.
num(1, "один"  ) :- !.
num(2, "два"   ) :- !.
num(3, "три"   ) :- !.
num(4, "четыре") :- !.
num(5, "пять"  ) :- !.
num(6, "шесть" ) :- !.
num(7, "семь"  ) :- !.
num(8, "восемь") :- !.
num(9, "девять") :- !.
num(10,"десять") :- !.
num(N,X) :-
        N<20, N>10, N2 is N-10, num(N2,X2),
        (append(X3,"ь",X2)                    ; X2=X3),
        (append(X4,"е",X3)                    ; X3=X4),
        (append(X6,"а",X4), append(X6,"е",X5) ; X4=X5),
        append(X5,"надцать",X), !.
num(40,"сорок") :- !.
num(90,"девяносто") :- !.
num(N,X) :-
        0 is N mod 10, N2 is N / 10, num(N2,X2),
        (N2<4, append(X2,"дцать",X);N2<10, append(X2,"десят",X)), !.
num(100,"сто") :- !.
num(N,X) :-
        %N < 100,
        N3 is N mod 10, N2 is N // 10 * 10, num(N2,X2), num(N3,X3),
        append(X2," ",X4),append(X4,X3,X), !.
%num(200,'двести').
