%:-[zaliz].
l:-[u],[m],[p],[tr],[lib].
portray(X):-write(X).
l(W,X):-name(W,WL),last(X,WL).
f(W,X):-name(W,[X|_]).
f2(W,X):-name(W,[_,X|_]).
w(W):-write(W),nl,fail.
w2(W):-writef('%w ',[W]),fail.
ww([F|L]):-writef(F,L),nl,fail.
% twolast(L,TL):-reverse(L,[Y,X|_]),name(TL,[X,Y]).
twolast(L,TL) :- suffix([X,Y],L), name(TL,[X,Y]).

type:-bagof(_,X^Y^Z^w(X,Y,W,Z),L),length(L,L2),ww(['%w: %w',W,L2]).

udr:-bagof(_,X^Y^Z^w(X,W,Y,Z),L),length(L,L2),ww(['%w: %w',W,L2]).
udrp:-w(W,S,_,_),name(W,WW),nth1(S,WW,X),not(гласная(X)),w(s(W,S)).

mzh:-w(W,_,'мо-жо',_),l(W,X),not(гласная(X)),w(W).
m:-(w(W,_,'м',_);w(W,_,'мо',_)),l(W,X),гласная(X),name(W,WL),not(suffix("ийся",WL)),w(W).
zh:-(w(W,_,'ж',_);w(W,_,'жо',_)),l(W,X),not(гласная(X)),X\==0'ь,w(W).
s:-(w(W,_,'с',_);w(W,_,'со',_)),l(W,X),X\==0'е,X\==0'о,w(W).

%wq(Q):-w(W,_,G,_),l(W,X),X\==0'е,X\==0'о,w(W).

wl :-
        w(W1,_,G1,_), name(W1,[H1|T]),
        length(T,L), L>5, буква(H1,F), буква(H2,F), H1\==H2,
        name(W2,[H2|T]), w(W2,_,G2,_), same_g(G1,G2), %not(same_g(G1,G2)),
        write([w1(W1,G1),w2(W2,G2)]), nl, fail.
% same_g(G1,G2) :- name(G1,[G|_]), name(G2,[G|_]).
same_g(G1,G2) :- name(G1,[G]), name(G2,[G,0'о|_]).

p:-w(W,_,'п',_),l(W,X),not(гласная(X)),X\==0'й,X\==0'в,X\==0'н,w(W).
ptl:-bagof(_,W^ptl(W,TL),L),length(L,LL),write([TL,LL]),nl,fail.
ptl(W,TL):-w(W,_,'п',_),name(W,WL),twolast(WL,TL).

gzho :- w(W,_,'жо',F), name(W,[0'г|_]), name(F,[0'1|_]), w(W). % :-)

гласная(0'а). гласная(0'е). гласная(0'ё). гласная(0'и). гласная(0'о).
гласная(0'у). гласная(0'ы). гласная(0'э). гласная(0'ю). гласная(0'я).

согласная(0'б). согласная(0'в). согласная(0'г). согласная(0'д). согласная(0'ж).
согласная(0'з). согласная(0'й). согласная(0'к). согласная(0'л). согласная(0'м).
согласная(0'н). согласная(0'п). согласная(0'р). согласная(0'с). согласная(0'т).
согласная(0'ф). согласная(0'х). согласная(0'ц). согласная(0'ч). согласная(0'ш).
согласная(0'щ).

буква(A,г) :- гласная(A).
буква(B,с) :- согласная(B).
буква(0'ь,др).
буква(0'ъ,др).
